var ProblemData = [
    ["你手脚发凉吗？","胃、后背或腰膝怕冷吗？","感到怕冷、衣服通常比别人穿得多吗？","你比一般人耐受不了寒冷吗？","你比别的小伙伴更容易感冒吗？","吃/喝凉东西不舒服或者怕吃/喝凉东西吗？","受凉或吃/喝凉东西后，容易拉肚子吗？","你感到手脚心发热吗？","你感觉身体、脸上发热吗？","皮肤或口唇干燥吗？","你口唇的颜色比一般人更红吗？"],
    ["容易便秘或大便干燥吗？","面部两颧潮红或偏红吗？","感到眼睛干涩吗？","感到口干咽燥、总想喝水吗？","你容易疲乏吗？","容易呼吸短促，上气不接下气吗？","容易心慌吗？","容易头晕或站起时晕眩吗？","你喜欢安静、懒得说话吗？","你说话声音无力吗？","活动量稍大就容易出虚汗吗？"],
    ["感到胸闷或腹部胀满吗？","感到身体沉重、不轻松，不爽快吗？","肚肚肥满松软吗？","额头油脂分泌多吗？","上眼睑有轻微隆起的现象吗？","你嘴里有黏黏的感觉吗？","平时痰多，咽喉总感觉有痰堵着吗？","舌苔厚腻或有舌苔厚厚的感觉吗？","面部或鼻部油腻、油亮发光吗？","容易生痤疮或疮疖吗？","感到口苦或嘴里有异味吗？"],
    ["拉粑粑时黏滞不爽，有解不尽的感觉吗？","嘘嘘时尿道有发热感、尿色深吗？","阴囊部位潮湿吗？","皮肤在不知不觉中会出现青紫瘀斑吗？","你两颧部有细微红丝吗？","你身上有哪里疼痛吗？","面色晦暗或容易长褐斑吗？","容易有黑眼圈吗？","容易健忘吗？","口唇颜色偏暗吗?","你感到闷闷不乐、情绪低沉吗？"],
    ["容易精神紧张、焦虑不安吗？","你多愁善感、感情脆弱吗？","容易感到害怕或受到惊吓吗？","前胸或乳房胀痛吗？","你会无缘无故叹气吗？","咽喉部有异物感，吐之不出、咽之不下吗？","没有感冒时，你也会打喷嚏吗？","没有感冒时，你也会鼻塞、流鼻涕吗？","你有因季节、温度变化或异味等原因而咳喘的现象吗？","你容易过敏（对药物、食物、气味、花粉或在季节交替、气候变化时）吗？","皮肤容易起风团、风疹块、风疙瘩吗？"],
    ["你会因过敏出现紫红色瘀点、瘀斑吗？","你的皮肤容易一抓就红，并出现抓痕吗？","你精力充沛吗？","你比别的小伙伴更受不了寒冷吗？","你能适应外界自然和社会环境的变化吗？","容易失眠吗？"]
]

var AnswerData = {

}