<?php
  $index_id = $_GET['index_id'];
  $yangxzh  = $_GET['yangxzh'];
  $yinxzh   = $_GET['yinxzh'];
  $qixzh    = $_GET['qixzh']; 
  $tanszh   = $_GET['tanszh'];
  $shirzh   = $_GET['shirzh'];
  $xueyzh   = $_GET['xueyzh'];
  $qiyzh    = $_GET['qiyzh'];
  $tebzh    = $_GET['tebzh'];
  $pinghzh  = $_GET['pinghzh'];

  $yangxzh2  = (1-$yangxzh/100)*155;
  $yinxzh2    = (1-$yinxzh/100)*155;
  $qixzh2     =  (1-$qixzh/100)*155; 
  $tanszh2   = (1-$tanszh/100)*155;
  $shirzh2    = (1-$shirzh/100)*155;
  $xueyzh2    = (1-$xueyzh/100)*155;
  $qiyzh2      = (1-$qiyzh/100)*155;
  $tebzh2     = (1-$tebzh/100)*155;
  $pinghzh2  = (1-$pinghzh/100)*155;
  
  $yangxzh1  = "<h1 class='result'>您的体质是：阳虚质<hr>
<h2>什么是阳虚体质?</h2>
<p>阳虚体质是当人体脏腑功能失调时易出现体内阳气不足、阳虚生里寒的表现</p>
<h2>阳虚体质的表现 </h2>
<p>易患痰饮、肿胀、泄泻等病，耐夏不耐冬，易感风、寒、湿邪。
常表现为面色苍白，气息微弱，体倦嗜卧，畏寒肢冷，全身无力或有肢体浮肿，舌淡胖嫩边有齿痕，苔淡白，脉沉微无力，多因先天禀赋不足、加之寒邪外侵或过食寒凉之品、忧思过极、房事不节、久病之后而发病。</p>
<h2>阳虚质的形成原因</h2> 
<p>1、经常在23点以后睡觉，长期熬夜；</p>
<p>2、经常食用冷饮和凉茶；</p>
<p>3、吹空调时离空调很近，在空调房里不穿长袖；</p>
<p>4、冬季习惯光脚穿鞋或鞋拖；</p>
<p>5、纵情过度；</p>
<p>6、衣服穿的过少，要风度不要温度；</p>
<p>7、过度控制饮食，营养不良；</p>
<p>8、先天禀赋不足，父母为阳虚质，或父母婚育年龄太大，或孕期吃了太多寒凉食物等。</p>
<p>9、喜欢吃生冷寒凉的失误或者工作环境阴冷潮湿；</p>
<p>10、长期、大量用抗生素、激素类、利尿剂、清热解毒中药；</p>
<p>11、久病损伤阳气；</p>
<p>12、长期大量运动，或喜欢桑拿等导致出汗过度；</p>
<p>13、汗出当风，大汗淋漓之后，总是要吹风，甚至洗冷水澡；</p>

<h2>阳虚质的分类 </h2>

<p>1.心阳虚证</p>
        证候：心悸心慌，心胸憋闷疼痛，形寒肢冷，失眠多梦，心神不宁，舌淡胖或紫暗，苔白滑，脉弱或结代。<br>
        治则：温补心阳。主方：保元煎。<br>
        常用药：党参、黄芪、肉桂、生姜、甘草、巴戟天等<br>
<p>2.脾阳虚证</p>
        证候：食少，大便溏薄，肠鸣，腹中冷痛，因外感寒、湿之邪或进寒凉菜饮食加剧，舌淡胖或有齿痕，苔白滑或有齿痕。<br>
        治则：温中健脾。主方：理中汤、附子理中汤。<br>
        常用药：党参、白术、附子、肉桂、干姜、肉豆蔻、补骨脂等。<br>
<p>3.肾阳虚证</p>
    证候：腰背酸痛，形寒肢冷，下利清谷或五更泻泄，多尿、遗精，阳痿，舌淡苔白，脉沉迟细弱无力。<br>
    治则：温补肾阳。主方：金匮肾气丸、右归丸。<br>
    常用药：附子、肉桂、杜仲、续断、菟丝子、当归、枸杞、鹿角胶、熟地、山茱萸、鹿茸等。<br>

<h2>阳虚质的预防保健 </h2>


<p>1.疗：饮食上要多吃些令身体温暖的食物：粮食类的面粉、高粱、糯米等；肉类的羊肉、牛肉、鸡肉、狗肉、鹿肉、麻雀、公鸡等；鱼类的草鱼、鲫鱼等；菜类的韭菜、芥菜、香菜、南瓜、生姜等；坚果类的核桃、松子、腰果、花生；水果类的荔枝、龙眼、桃子、大枣、核桃、桔子、樱桃等。也要适当吃些熟萝卜、白菜、芹菜、青菜，以免进补过度而上火。单独吃青菜的时候需要用些热性的调料，如：生姜、大蒜、胡椒等。黄芪、枸杞可以作为炖菜煲汤的配料。身体虚弱的老人可以用虫草、人参少量多次补养。</p>
<p>2.运动：“动则生阳”，加强体育锻炼，选择适合自己的运动项目和强度，如选择瑜伽、太极拳、五禽戏等活动。</p>
<p>3.保健：避免受风寒湿邪，生活起居有规律，戒烟酒，舒情志、少烦忧。</p>
";
  $yinxzh1   = "<h1 class=‘result’>您的体质是：阴虚质</h1>
<h2>什么是阴虚体质</h2>

<p>阴虚质是指当脏腑功能失调时，易出现体内阴液不足，阴虚生内热的证候。</p>

<h2>阴虚体质的表现</h2> 

<p>易患虚劳、失精、不寐等，耐冬不耐夏，不耐受暑、热、燥邪。 常表现为形体消瘦，两颧潮红，手足心热，潮热盗汗，心烦易怒，口干，头发、皮肤干枯，舌干红、少苔，甚至光滑无苔，多因燥热之邪外侵、过食温燥之品、忧思过度、房事不节、久病之后而发病。</p>

<h2>阴虚质的形成原因</h2> 

<p>1、先天禀赋，父母遗传；</p>
<p>2、情绪长期压抑不舒展。不能正常发泄会郁结而化火，化火就会向身体内部燃烧消耗，使阴精暗耗；</p>
<p>3、长期心脏功能不好，或高血压病人吃利尿药太多；</p>
<p>4、长期食用辛辣燥热的食品；</p>
<p>5、过多服用利尿药或清热利湿方剂；</p>
<p>6、经常熬夜</p>

<h2>阴虚质的分类</h2> 

<p>1.肺阴虚证 证候：干咳，痰少黏白，或痰中带血丝，咽喉干燥，舌红少津，脉细数。</p>
        治则：养阴润肺，佐以清肺热。主方：沙参麦冬汤，百合固金汤。<br>
        常用药：沙参、麦门冬、百合、玄参、天花粉、玉竹、白扁豆、桑白皮、浙贝、桔梗、太子参
<p>2.心阴虚证 证候：失眠多梦，五心烦热，心悸，舌红少津，脉细数。 治则：滋养心阴，佐以清心热。</p>
        主方：天王补心丹。<br>
        常用药：天冬、生地、玄参、丹参、酸枣仁、远志、茯苓、当归、淡竹叶；
<p>3.脾胃阴虚证 证候：不思饮食，大便硬结，口干唇燥，甚或干呕，舌红少津，脉细数。</p>
        治则：养阴和胃，佐以清胃热。主方：益胃汤。<br>
        常用药：沙参、麦冬、白芍、淮山药、石斛、天花粉、蜂蜜、葛根；
<p>4.肝阴虚证 证候：两目干涩，头痛头晕，视物不明，舌红少津，脉弦细数。 治则：滋养肝阴，佐以清肝热。</p>
        主方：四物汤，一贯煎。<br>
        常用药：生地、白芍、当归、何首乌、木瓜、女贞子、旱莲草、牡丹皮、枸杞、菊花、钩藤。
<p>5.肾阴虚证 证候：腰酸腿软，头晕耳鸣，遗精健忘，尿少，头发皮肤干枯，舌红少津少苔或无苔，脉细数。</p>
        治则：滋补肾阴，佐以清下焦热。<br>
        主方：六味地黄丸。<br> 
常用药：熟地、淮山药、枸杞、山茱萸、牡丹皮、茯苓、泽泻、知母、黄柏、菊花、麦冬、五味子。 

<h2>阴虚质的预防保健</h2> 

<p>1、食疗：阴虚体质的人平素适当进些滋补阴液以及甘凉滋润的食物，如糯米、藕、黑木耳、银耳、甘蔗、梨、百合、山药、枸杞、麦冬、鳖、龟肉、海参、阿胶等。可选用枸杞、百合、银耳、麦冬、山药煲瘦猪肉、鸭肉、猪肺汤。</p>
<p>2、忌食：辛辣刺激性、温热香燥、煎炸炒爆的物品；少食过分温热燥热的食物，以免耗伤人体阴液，如辣椒、大蒜、韭菜、花椒、桂皮、干姜、丁香、羊肉、狗肉等。</p>
<p>3、运动：阴虚虽属虚，但阴虚则阳亢，阳代表功能，其运动耐性好于阳虚、气虚与血虚等体质，可进行中等强度的体育锻炼，一般的球类、跑步、游泳、爬山等常见的运动均可进行。其中游泳因能滋润肌肤，减少皮肤干燥感，尤宜于皮肤干燥甚者。而太极拳、太极剑、气功、八段锦、五禽戏等动静结合、形神并练的传统项目更为适宜，尤其是静气功锻炼对人体内分泌具双向调节功能，既助阳、亦生阴，可增加体液的生成，亦可调节易于兴奋的精神状态，从而改善阴虚状态。</p>
";
  $qixzh1    = "<h1 class=‘result’>您的体质是：气虚质</h1>
<h2>什么是气虚体质</h2>

<p>气虚体质内脏功能不强，常因外邪或内在饮食积滞产生内热等虚实夹杂之症。</p>

<h2>气虚体质的表现</h2> 

<p>常表现为语声低微，形体消瘦或偏胖，面色苍白，气短懒言，精神不振，体倦乏力，常自汗出，动则尤甚，舌淡红，舌边有齿痕，苔白，脉虚弱，因各种病因而发病，因心肺脾肾气虚部位不同而并见不同的症状。易患感冒、内脏下垂，平素抵抗力弱，病后康复缓慢。以补气养气为总治则，还应针对脏腑辩证，分别选用补脏腑之气方药。根据气血同源理论，适当加用补血药。</p>

<h2>气虚质的形成原因</h2> 

<p>1、母亲怀孕时营养不足，妊娠反应强烈持久不能进食、早产、喂养不当。或父母一方是气虚质；</p>
<p>2、大病、久病之后，元气大伤；</p>
<p>3、神过劳，长期过度用脑，劳伤心思，思虑伤脾；</p>
<p>4、形过劳，曾经是重体力劳动者或者是职业运动员；</p>
<p>5、长期节食会造成人体摄入营养不足，形成气虚；</p>
<p>6、喜欢吃冰冷寒凉、肥甘厚腻、缺乏运动；</p>
<p>7、七情郁结，不开心，尤其是吃饭时生气。</p>

<h2>气虚质的分类</h2> 

<p>1.心气虚证</p>
        证候：心悸，胸闷，舌质淡，脉虚结代；<br>
        治则：益气养心。主方：养心汤、七福饮。<br>
        常用药：人参、白术、甘草、黄芪、当归、川芎。
<p>2.肺气虚证</p>
        证候：咳嗽无力，少气短息，动则益盛，痰液清稀，平素易感冒，舌淡苔白，脉弱；<br>
        治则：补益肺气。主方：补肺汤、玉屏风散、生脉散。<br>
        常用药：党参、黄芪，淮山药、太子参、麦冬、白术、甘草、大枣、熟地、五味子。
<p>3.脾胃气虚证</p>
        证候：饮食减少、食后胃脘不适、大便溏薄、面色萎黄，舌淡苔白，脉缓弱；<br>
        治则：健脾益气。主方：四君子汤、参苓白术散。<br>
        常用药：党参、黄芪，淮山药、白扁豆、薏苡仁、麦冬、白术、甘草。
<p>4.肾气虚证</p>
        证候：腰膝酸软，小便频数而清，白带清稀，舌淡苔白，脉沉细弱。
        治则：益气补肾。主方：肾气丸、大补元煎。<br>
        常用药：党参、熟地、生地、淮山药、枸杞、山茱萸、当归、甘草，菟丝子、益智仁。

<h2>气虚质的预防保健</h2> 


<p>1.气虚体质的人平素宜采用饮食调理，多吃补气益气、易消化、性平味甘的食物，如：大枣、山药、龙眼肉、莲子、薏苡仁、芡实、黄芪、党参、白扁豆、粳米等；忌食生冷性凉、油腻厚味等耗伤脾胃的食物，如：西瓜、香瓜、水梨、香蕉、黄瓜、苦瓜、空心菜、筊白、笋、蚌类等。</p>
<p>2.适量运动。气虚体质易出现肌肉松软，倦怠乏力，不喜运动，抵抗力弱，因此生活调摄方面要做到，起居有规律，谨避风寒之邪，“劳则气耗”，不适合激烈、长时间的运动，以免耗伤正气</p>
"; 
  $tanszh1   = "<h1 class=‘result’>您的体质是：痰湿质</h1>
<h2>什么是痰湿体质</h2>

<p>痰湿体质是指当人体脏脏功能失调，易引起气血津液运化失调，水湿停聚，聚湿成痰而成痰湿内蕴表现</p>

<h2>痰湿体质的表现</h2> 

<p>常表现为体形肥胖，腹部肥满，胸闷，痰多，容易困倦，身重不爽，喜食肥甘醇酒，舌体胖大，舌苔白腻，多因寒湿侵袭、饮食不节，先天禀赋、年老久病、缺乏运动而发病，常随痰湿留滞部位不同而出现不同的症状；
易患消渴、中风、胸痹等，对梅雨及湿重环境适应力差。应以燥湿化痰为治疗大法，平素注意调护改善痰湿体质防止痰湿病证发生。</p>

<h2>痰湿质的形成原因</h2> 

<p>1、伤肺：久坐，长时间含胸塌背，压迫肺部。呼吸浅，再加上有空气污染，导致氧气不足，体内食物很难代谢，致使痰湿堆积体内，从而易促生痰湿体质；</p>
<p>2、伤脾：长期食物肥甘厚味，冰冻寒凉，暴饮暴食，常吃减肥药。经常发怒，情志不舒展，导致伤肝，转而伤脾。不吃早餐、熬夜、宵夜，饮酒过多，伤肝转而伤脾（饮食不节易伤脾胃，发怒、熬夜则易伤肝，肝木克脾土，伤肝就容易伤脾）；</p>
<p>3、伤肾：长期口味偏咸，食盐过多。口味过重，长期吃盐太多会增加水湿，既伤脾，也伤肾；</p>

<h2>痰湿质的分类</h2> 

<p>1.痰湿蕴肺</p>
        证候：咳嗽反复发作，痰多黏腻或稠厚成块，色白或带灰色，进甘甜油腻食物加重，体倦，舌苔白腻，脉濡滑。<br>
        治则：燥湿化痰、温肺降逆。<br>
        主方：二陈平胃散合三子养亲汤。<br>
        常用药：陈皮、煮半夏、茯苓、厚朴、莱菔子、白芥子、紫苏子等。
<p>2.痰湿中阻</p>
        证候：腹部痞塞不舒，进食尤甚，胸闷，头晕目眩，身重困倦，恶心呕吐，胃纳呆滞，口淡不渴，大便正常或不实，舌苔厚腻，脉沉滑。<br>
        治则：燥湿化痰、理气和中。<br>
        主方：二陈平胃散。<br>
        常用药：陈皮、煮半夏、茯苓、厚朴、苍术等。
<p>3.痰湿蒙窍（痰蒙清窍）</p>
        证候：头重昏蒙，胸闷恶心，呕吐痰涎，食少多睡困乏，舌苔厚腻，脉沉滑。<br>
        治则：燥湿化痰，健脾和胃，平肝息风。<br>
        主方：半夏白术天麻汤。<br>
        常用药：白术、天麻、陈皮、煮半夏、茯苓、竹茹等。

<h2>痰湿质的预防保健</h2> 


<p>痰湿体质的人宜养成良好的饮食习惯，忌食肥甘厚味生冷之物，戒烟酒，平时可以多吃点生姜，多进蔬菜、水果等富含纤维、维生素的食物，保持大便顺畅正常。因“脾为生痰之源，肺为贮痰之器”，痰湿体质的人平素可适当服用六君子丸或杏苏二陈丸健脾化痰。避免涉水淋雨，久居湿地，注意保暖，防止外感寒湿之邪伤脾困脾，特别梅雨季节注意防潮湿。适当参加体育锻炼，应以微汗为宜，以助气血顺畅。</p>
<p>1.饮食：少甜少酒，少辣少油，少吃甜食、辛辣刺激的食物。少喝酒，所有食物里边，湿热之性最大的就是酒。湿热体质兼杂痰湿体质，最忌讳使用经过油炸煎炒烧烤等高温加工烹制而成的食物。</p>
<p>2.运动：痰湿质者，形体多肥胖，运动则气机调畅，有利于津液的运行与代谢，改善体质增进健康。一般宜选择强度中等的运动；若选择运动强度比较小的运动项目进行锻炼，则每天运动时间应该适当延长，在保证有足够的运动量时，减肥效果才能出来。如登山、慢跑、自行车、乒乓球、羽毛球、网球、武术、游泳、健身舞蹈等都可选择。对于体重超重，陆地运动能力极差的人，游泳是较好的选择。</p>
";
  $shirzh1   = "<h1 class=‘result’>您的体质是：湿热质</h1>
<h2>什么是湿热体质</h2>


<p>所谓湿，即通常所说的水湿，它有外湿和内湿的区分。外湿是由于气候潮湿或涉水淋雨或居室潮湿，使外来水湿入侵人体而引起；内湿是一种病理产物，常与消化功能有关。中医认为脾有“运化水湿”的功能，若体虚消化不良或暴饮暴食，吃过多油腻、甜食，脾就不能正常运化而使“水湿内停”；且脾虚的人也易招来外湿的入侵，外湿也常困阻脾胃使湿从内生，所以两者是既独立又关联的。</p>
 
<p>所谓热，则是一种热象。而湿热中的热是与湿同时存在的，或因夏秋季节天热湿重，湿与热合并入侵人体，或因湿久留不除而化热，或因“阳热体质”而使湿“从阳化热”，因此，湿与热同时存在很常见。</p>


<h2>湿热体质的表现</h2> 


<p>肢体沉重，发热多在午后明显，并不因出汗而减轻；舌苔黄腻，脉数。具体表现因湿热所在不同的部位而有差别：在皮肉则为湿疹或疔疱；在关节筋脉则局部肿痛。但通常所说的湿热多指湿热深入脏腑，特别是脾胃的湿热，可见脘闷腹满，恶心厌食，便溏稀，尿短赤，脉濡数；其他如肝胆湿热表现为肝区胀痛，口苦食欲差，或身目发黄，或发热怕冷交替，脉弦数；膀胱湿热见尿频、尿急，涩少而痛，色黄浊；大肠湿热见腹痛腹泻，甚至里急后重，泻下脓血便，肛门灼热、口渴；</p>



<h2>湿热质的形成原因</h2> 


<p>1、先天禀赋。</p>
<p>2、嗜烟酒的，经常熬夜的；</p>
<p>3、滋补不当：如吃很多银耳燕窝冬虫夏草。乌鸡白凤丸等，这样的滋补不当，滋补过度会促生或者加重这种体质。</p>
<p>4、长期情绪压抑，借酒浇愁。</p>
<p>5、肝炎病毒携带:肝胆是薄弱环节，肝胆疏泄不好，很多发现肝经胆腑等的症状。</p>
<p>6、长期生活在湿热环境下，比如广东。亚健康状态特别多见于湿热体质。</p>


<h2>湿热质的预防保健</h2> 


<p>1、选择清热除湿、燥湿醒脾的药食清热除湿。多吃清热除湿的食物、药物，尤其是在气候湿热的夏秋两季，可以保持体内清爽，阻止湿热侵犯，同时能滋阴清热，防止功能亢进造成虚热。</p>
<p>2、健脾滋阴。就身体的内环境而言，脾虚而不得化湿，阴虚生内热，是产生湿热的因素，因此在清热除湿的同时还要注意健脾滋阴。脾胃好了，体内湿热得以运化，身体适应能力增强，湿热也就不容易入侵了。</p>
<p>3、戒除烟酒。中医认为，烟草为辛热秽浊之物，很容易生热助湿。酒是热性，有助阳热的功效，同时有生痰湿的弊端，所以湿热质人饮酒很容易酿生湿热。
清热解毒从内美到外</p>
<p>4、食疗还是满重要的，譬如绿豆、黄瓜、芹菜、马齿苋、西葫芦、西瓜、冬瓜、苦瓜、赤豆、西红柿、乌梅、荷叶、茄子、鲜藕、百合、丝瓜、莲藕等。</p>
要除湿热，饮食必须以清淡为主，辣椒、狗肉、牛肉、羊肉、酒等，最好想都不要想;韭菜、生姜、胡椒、花椒等甘温滋腻，以及火锅、烹炸、烧烤等辛温助热的食物，得少吃;取而代之的，应该是赤小豆、绿豆、芹菜、黄瓜、薏苡仁、莲子、茯苓、鸭肉、鲫鱼、冬瓜、苦瓜、藕等甘寒、甘平的食物。</p>
<p>5、除湿祛热的药材：龙胆草、黄芩、栀子、泽泻、木通、车前子、生地、当归、柴胡、甘草、薏苡仁、茯苓、苦瓜、莲子；一般来说，我们多用三仁汤，即杏仁、飞滑石、白通草、白蔻仁、竹叶、厚朴、生薏仁、半夏作为基础方，进行加减治疗</p>
";
  $xueyzh1   = "<h1 class=‘result’>您的体质是：血瘀质</h1>
<h2>什么是血瘀体质</h2>

<p>血瘀体质是指当人体脏腑功能失调时，易出现体内血液运行不畅或内出血不能消散而成瘀血内阻的体质</p>

<h2>血瘀体质的表现</h2> 

<p>常表现面色晦黯，皮肤粗糙呈褐色，色素沉着，或有紫斑，口唇黯淡，舌质青紫或有瘀点，脉细涩。多因七情不畅，寒冷侵袭，年老体虚、久病未愈等病因而发病，常随瘀血阻滞脏腑经络部位不同而出现不同的症状；
易患症瘕、痛症及血证。应以活血化瘀为总治则，平素注意调护改善血瘀体质防止疾病发生。</p>

<h2>血瘀质的形成原因</h2>

<p>1、长期服药：药物都要通过肝脏代谢，长期服药会加重肝脏的负担，肝脏长期受累，就容易产生血瘀；</p>
<p>2、七情不调：长期抑郁，爱钻牛角尖，容易伤及肝脏，肝脏长期不舒展，易生血瘀；</p>
<p>3、痤疮。常见难以透脓的暗紫小丘疹或结节为主。痤疮之后的暗疮印（色素沉着）很难消散；</p>
<p>4、久病不愈：久治不愈，容易使血瘀在微循环系统得到发展，逐渐促生血瘀体质；</p>
<p>5、受到比较严重的创伤：受创伤后，体内会留有难以彻底消融的瘀血，体质就此发生变化，从而促生血虚体质；</p>
<p>6、工作生活环境寒冷：血脉遇寒则凝，长期在寒冷的环境中工作生活易生阳虚体质，这种体质一般都间杂瘀血</p>

<h2>血瘀质的分类</h2> 

<p>1.瘀阻于肺</p>
证候：胸痛咳嗽，气促，甚者喘息不能平卧，胸闷如塞，心悸不宁，舌质紫暗或淤斑、瘀点，脉弦涩。<br>
治则：活血理气，行瘀通络。主方：桃仁红花煎。<br>
常用药：桃仁、红花、当归，川芎，赤芍、桑白皮、薏苡仁等。
<p>2.瘀阻于心</p>
证候：胸闷疼痛，痛引肩背，心悸，口唇青紫，舌质青紫或淤斑、瘀点，脉涩或结代；<br>
治则：活血理气通脉。主方：血府逐瘀汤。<br>
常用药：桃仁、红花、当归，川芎，丹参、桂枝、赤芍、枳壳、郁金、玫瑰花等。
<p>3.瘀阻于胃</p>
证候：胃痛，按之痛甚，食后加剧或有包块，入夜尤甚，甚者便血或呕血，舌质淤斑、瘀点，脉弦涩。<br>
治则：化瘀通络止血、理气和胃。主方：失笑散合丹参饮。<br>
常用药：蒲黄、五灵脂、丹参、檀香、砂仁、延胡等。
<p>4.瘀阻于肝</p>
证候：胁痛痞块，入夜尤甚，舌质紫暗或有淤斑点，脉弦涩。<br>
治则：祛瘀通络，疏肝理气。主方：膈下逐瘀汤。<br>
常用药：桃仁、红花、当归，川芎，丹参、香附、赤芍、乌药、枳壳、延胡索等。
<p>5.瘀阻于肢体</p>
证候：肢体局部可见局部的肿痛或青紫，舌质紫或淤斑、瘀点，脉涩。<br>
治则：活血行气，袪风除湿、通痹止痛。主方：身痛逐瘀汤。<br>
常用药：桃仁、红花、当归，川芎，丹参、、赤芍、枳壳、秦艽、羌活、地龙等。
<p>6.瘀阻于胞宫</p>
证候：少腹疼痛，月经不调，痛经，经色紫黑有块，舌质紫暗或淤斑、瘀点，脉弦涩。<br>
治则：活血化瘀，和络止痛。主方：少腹逐淤汤。<br>
常用药：当归、川芎，赤芍、延胡索、肉桂、干姜等。
<p>7.瘀阻脑窍</p>
证候：眩晕，头痛经久不愈，兼见健忘，失眠，心悸、耳鸣耳聋，舌质紫暗或淤斑、瘀点，脉弦涩。<br>
治则：祛瘀生新，活血通窍。主方：通窍活血汤。<br>
常用药：桃仁、红花、当归，川芎，丹参、、赤芍、枳壳、地龙等。

<h2>血瘀质的预防保健</h2> 

<p>1.饮食调理</p>
血瘀体质的人宜多吃补气补血、养血活血行气的食物，以促进身体血液循环，例如桑椹、猪肉、羊肉、山楂、醋、红糖、黄酒、葡萄酒等。
<p>2.心理调养</p>
血瘀体质的人要注意日常调整自身心理状态，保持乐观、豁达的情绪，避免情绪过极，以利气血通畅。
<p>3.生活起居调养</p>
血瘀体质的人需注意气候变化增减衣被，避免寒冷，居处保持通风、暖和。
<p>4.运动养生</p>
血瘀体质的人需注意调整自身气血，适当参加有益于心脏血脉的活动，如各种舞蹈、气功、保健操等。但要劳逸结合，保证充足睡眠，做到动中有静。
<p>5.中医调养</p>
血瘀体质的人，可适当选用推拿、按摩、拔罐、刮痧等疗法。
";
  $qiyzh1    = "<h1 class=‘result’>您的体质是：气郁体质</h1>
<h2>什么是气郁体质</h2>


<p>气郁体质是由于长期情志不畅、气机郁滞而形成的以性格内向不稳定、忧郁脆弱、敏感多虑为主要表现的体质；</p>


<h2>气郁体质的表现</h2> 


<p>1、形体消瘦或偏胖，面色苍暗或萎黄；</p>
<p>2、平素性情急躁易怒，易于激动，或忧郁寡欢，胸闷不舒；</p>
<p>3、舌淡红，苔白，脉弦；</p>
<p>4、一旦生病则胸肋胀痛或窜痛；</p>
<p>5、有时乳房及小腹胀痛，月经不调，痛经；</p>
<p>6、咽中梗阻，如有异物；或颈项瘿瘤；</p>
<p>7、胃脘胀痛，泛吐酸水，呃逆哎气；</p>
<p>8、腹痛肠鸣，大便泄利不爽；</p>
<p>9、体内之气逆行，头痛眩晕。</p>


<h2>气郁质的形成原因</h2> 


<p>一般来说，气郁和人本身的性格有关，有的人平素性情急躁易怒，易激动，有的人经常郁郁寡欢，疑神疑鬼。这几种性格的形成，可能是先天遗传，也有可能是生活中受到精神刺激、突然惊吓、恐惧。有些人由于个人欲望得不到实现，长期忧愁、郁闷、焦虑等，有了心事也不愿意讲出来，自己也不能化解，时间一长，堵在心里的怨气越来越多，就觉得心烦胸闷，引起气机运行不畅。中医认为，人体“气”的运行主要靠肝的调节，气郁主要表现在肝经所经过的部位气机不畅，所以又叫做“肝气郁结”。 </p>


<h2>气郁质的预防保健</h2> 


<p>气郁气质着具有气机郁结而不舒畅的潜在倾向，应选用具有理气解郁、调理脾胃功能的食物，如大麦、荞麦、高粱、刀豆、蘑菇、豆豉、苦瓜、萝卜、洋葱、菊花、玫瑰等。气郁体质者应少食收敛酸涩之物，如乌梅。南瓜、泡菜、石榴、青梅、杨梅、草莓、杨桃、酸枣、李子、柠檬等，一面阻滞气机，气滞则血凝。亦不可多食冰冷食品，如雪糕、冰激凌、冰冻饮料等。</p>
疏肝理气，少量饮酒
<p>多食行气的药材：佛手、陈皮、茉莉花、玫瑰花、苦荞、茴香菜、百合、大麦茶、香附、乌药、川楝子、小茴香、青皮、郁金等</p>
";
  $tebzh1    = "<h1 class=‘result’>您的体质是：特禀体质</h1>
<h2>什么是特禀体质</h2>


<p>特禀质就是特殊禀赋。是指由于遗传因素和先天因素所造成的特殊状态的体质，主要包括过敏体质、遗传病体质、胎传体质等。</p>


<h2>特禀体质的表现</h2> 


<p>过敏体质者易药物过敏，易患花粉病症；遗传疾病如血友病、先天愚型及中医所称“五迟”、“五软”、“解颅”等；胎传疾病如胎寒、胎热、胎惊、胎肥、胎痫、胎弱等。对外界环境适应能力：适应能力差，如过敏体质者对过敏季节适应能力差，易引发宿疾。</p>



<h2>特禀质的预防保健</h2> 


<p>1. 情志调摄</p>
过敏体质的人因对过敏原敏感，容易产生紧张、焦虑等情绪，因此要在尽量避免过敏原的同时，还应避免紧张情绪。
<p>2. 饮食调养</p>
饮食宜均衡、粗细粮食搭配适当、荤素配伍合理，宜多食益气固表的食物，尽量少食辛辣、腥发食物，不食含致敏物质的食品，如蚕豆、白扁豆、羊肉、鹅肉、鲤鱼、虾、蟹、茄子、辣椒、浓茶、咖啡等。
<p>参考食疗方：</p>
(1)固表粥：乌梅、黄芪、当归、粳米，具有益气养血脱敏功效，适合过敏体质易发皮肤过敏者食用。
(2)黄芪首乌藤炖猪瘦肉：黄芪、首乌藤、猪瘦肉、食盐、葱、生姜、料酒、味精各适量，具有益气养血、祛风脱敏功效，适合过敏体质者食用。
<p>3. 起居调摄</p>
起居要有规律，保持充足的睡眠时间。居室宜通风良好。生活环境中接触的物品如枕头、棉被、床垫、地毯、窗帘、衣橱易附有尘螨，可引起过敏，应经常清洗、日晒。外出也要避免处在花粉及粉刷油漆的空气中，以免刺激而诱发过敏病症。
<p>4. 运动保健</p>
宜进行慢跑、散步等户外活动，也可选择下棋、瑜珈等室内活动。不宜选择大运动量的活动，避免春天或季节交替时长时间在野外锻炼。运动时注意避风寒，如出现哮喘、憋闷的现象应及时停止运动。
";
  $pinghzh1  = "<h1 class=‘result’>您的体质是：平和质</h1>
<h2>什么是平和体质</h2>

<p>以体态适中、面色红润、精力充沛、脏腑功能状态强健壮实为主要特征的一种体质状态。又称为“平和质”。 平和质所占人群比例，约为32.75%，也就是三分之一左右。男性多于女性，年龄越大，平和体质的人越少。</p>

<h2>平和体质的表现</h2> 
<p>面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉通利，味觉正常，唇色红润，精力充沛，不易疲劳，耐受寒热，睡眠安和，胃口良好，两便正常，舌色淡红，苔薄白，脉和有神。</p>
";

  $footer ="<div id=footer style='margin:0 auto;width:480px;'>
             <a href='http://4.hytyy.sinaapp.com'><div id=button style='color:white;width:110px;height:50px;background-color:red;display:inline;float:left;line-height:50px;border-radius: 10px;margin:10px 20px;padding:10px 40px;'>重新测试</div></a>
             <a href='http://mp.weixin.qq.com/s?__biz=MzA4MTI5NjI0NQ==&mid=400956052&idx=1&sn=be7d61234812573f3c53096164d96a60#rd'><div id=button style='color:white;width:110px;height:50px;background-color:red;display:inline;float:left;line-height:50px;border-radius: 10px;margin:10px 20px;padding:10px 40px;'>关注我们</div></a>
         </div>"
?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<meta http-equiv="Content-Type" content="text/html"; charset="utf-8" />
	<title>体质自测 |  - 四季草堂</title>
	<meta name="Description" content="" />
	<meta name="Keywords" content="" />
    <meta name="viewport" content="target-densitydpi=device-dpi, width=640, user-scalable=no">
	<link href="css/jquery-ui.min.css" rel="stylesheet" type="text/css" />
	<script src="js/jquery.js" type="text/javascript"></script>
	<script src="js/jquery.min.js" type="text/javascript"></script>
	<script src="js/jisuan.js" type="text/javascript"></script>
    <style type="text/css">
        #csjg {font-size:25px;};
        #button {}
    </style>
</head>
<body>

	 <div style="border:1px solid #AAAAAA;height:3000px;background-color:#FFFFEE;width:620px;margin:0 auto;">
            <div style="position:relative;top:0px;left:0px;width:100%;">
              <div style="position:relative;top:10px;width:620px;height:auto;">
              <img src="http://img.zhuyun.cn/M00/30/5C/wKgJNFXMCfyAIsjiAACVaQvNYMM900.png" style="width:100%;height:auto;" /> 
              <!--柱子-->
              <div style="position:absolute;left:0px;top:0px;width:100%;height:100%;">
			  
                <div style="position:absolute;left:6%;top:13.4%;width:8%;height:66.7%;background-color:#558855;"
                id="zhu1"></div>
                <div style="position:absolute;left:6%;top:13.4%;width:8%;height:<?php echo  $yangxzh2  ?>px;overflow:hidden;" id="zhu11">
                  <div style="position:absolute;left:0px;bottom:0px;" id="1a"><?php echo  $yangxzh;  ?></div>
                  <img name="im" style="width:50px;height:155px;"
                  src="http://img.zhuyun.cn/M00/67/6B/wKgJNFUU0HuAbbl6AAAxUHeHbvE946.jpg" />
                </div>
				
                <div style="position:absolute;left:17%;top:13.4%;width:8%;height:66.7%;background-color:#558855;" id="zhu2"></div>
                <div style="position:absolute;left:17%;top:13.4%;width:8%;height:<?php echo  $yinxzh2 ?>px;overflow:hidden;" id="zhu22">
                  <div style="position:absolute;left:0px;bottom:0px;" id="2a"><?php echo  $yinxzh ?></div>
                  <img name="im" style="width:50px;height:155px;"
                  src="http://img.zhuyun.cn/M00/67/6B/wKgJNFUU0HuAbbl6AAAxUHeHbvE946.jpg" />
                </div>
                <div style="position:absolute;left:28%;top:13.4%;width:8%;height:66.7%;background-color:#558855;" id="zhu3"></div>
                <div style="position:absolute;left:28%;top:13.4%;width:8%;height:<?php echo  $qixzh2 ?>px;overflow:hidden;" id="zhu33">
                  <div style="position:absolute;left:0px;bottom:0px;" id="3a"><?php echo  $qixzh ?></div>
                  <img name="im" style="width:50px;height:155px;"
                  src="http://img.zhuyun.cn/M00/67/6B/wKgJNFUU0HuAbbl6AAAxUHeHbvE946.jpg" />
                </div>
                <div style="position:absolute;left:39%;top:13.4%;width:8%;height:66.7%;background-color:#558855;" id="zhu4"></div>
                <div style="position:absolute;left:39%;top:13.4%;width:8%;height:<?php echo  $tanszh2 ?>px;overflow:hidden;" id="zhu44">
                  <div style="position:absolute;left:0px;bottom:0px;" id="4a"><?php echo  $tanszh  ?></div>
                  <img name="im" style="width:50px;height:155px;"
                  src="http://img.zhuyun.cn/M00/67/6B/wKgJNFUU0HuAbbl6AAAxUHeHbvE946.jpg" />
                </div>
                <div style="position:absolute;left:50%;top:13.4%;width:8%;height:66.7%;background-color:#558855;" id="zhu5"></div>
                <div style="position:absolute;left:50%;top:13.4%;width:8%;height:<?php echo  $xueyzh2 ?>px;overflow:hidden;" id="zhu55">
                  <div style="position:absolute;left:0px;bottom:0px;" id="5a"><?php echo  $xueyzh ?></div>
                  <img name="im" style="width:50px;height:155px;"
                  src="http://img.zhuyun.cn/M00/67/6B/wKgJNFUU0HuAbbl6AAAxUHeHbvE946.jpg" />
                </div>
                <div style="position:absolute;left:61%;top:13.4%;width:8%;height:66.7%;background-color:#558855;" id="zhu6"></div>
                <div style="position:absolute;left:61%;top:13.4%;width:8%;height:<?php echo  $qiyzh2 ?>px;overflow:hidden;" id="zhu66">
                  <div style="position:absolute;left:0px;bottom:0px;" id="6a"><?php echo  $qiyzh ?></div>
                  <img name="im" style="width:50px;height:155px;"
                  src="http://img.zhuyun.cn/M00/67/6B/wKgJNFUU0HuAbbl6AAAxUHeHbvE946.jpg" />
                </div>
                <div style="position:absolute;left:72%;top:13.4%;width:8%;height:66.7%;background-color:#558855;" id="zhu7"></div>
                <div style="position:absolute;left:72%;top:13.4%;width:8%;height:<?php echo  $tebzh2 ?>px;overflow:hidden;" id="zhu77">
                  <div style="position:absolute;left:0px;bottom:0px;" id="7a"><?php echo  $tebzh ?></div>
                  <img name="im" style="width:50px;height:155px;"
                  src="http://img.zhuyun.cn/M00/67/6B/wKgJNFUU0HuAbbl6AAAxUHeHbvE946.jpg" />
                </div>
                <div style="position:absolute;left:83%;top:13.4%;width:8%;height:66.7%;background-color:#558855;" id="zhu8"></div>
                <div style="position:absolute;left:83%;top:13.4%;width:8%;height:<?php echo  $pinghzh2 ?>px;overflow:hidden;" id="zhu88">
                  <div style="position:absolute;left:0px;bottom:0px;" id="8a"><?php echo  $pinghzh ?></div>
                  <img name="im" style="width:50px;height:155px;"
                  src="http://img.zhuyun.cn/M00/67/6B/wKgJNFUU0HuAbbl6AAAxUHeHbvE946.jpg" />
                </div>
              </div></div>
            </div>
			<div id="csjg" style="position:absolute;top:240px;margin:0 10px;width:620px;">
	<?php  //判断体质
  
  switch($index_id){
		   case"1000010":
		     echo $pinghzh1.$footer;
		     break;
		   case"1000011":
		     echo $yangxzh1.$footer;
		     break;
		   case"1000012":
		     echo $yinxzh1.$footer;
		     break;
		   case"1000013":
		     echo $qixzh1.$footer;
		     break;
		   case"1000014":
		     echo $tanszh1.$footer;
		     break;
		   case"1000015":
		     echo $shirzh1.$footer;
		     break;
		   case"1000016":
		     echo $xueyzh1.$footer;
		     break;
		   case"1000017":
		     echo $qiyzh1.$footer;
		     break;
		   case"1000018":
		     echo $tebzh1.$footer;
		     break;
		   default:
		     echo "<h1 align=center>请您先完成测试哦。</h1>";
		     break;
	   }?>
	   </div>
         
         
          </div>
		  
	
	
</body>
</html>